In [1]:
from sqlalchemy import create_engine, text
engine = create_engine("mysql+mysqlconnector://root:abc@127.0.0.1:3306/cs544")
conn = engine.connect()

In [2]:
list(conn.execute(text("show tables;")))

[]

In [3]:
# table: users
# columns: id, name, phone
# name is required
# id uniquely identifies row
conn.execute(text("""
    create table users (id int, name text NOT NULL, phone text, primary key(id))
"""))

In [4]:
conn.execute(text("""
    INSERT INTO users (id, name) VALUES (1, "tyler")
"""))

In [5]:
conn.execute(text("""
    create table accounts (user_id int, name text NOT NULL, amount int NOT NULL,
                           foreign key (user_id) references users(id))
"""))

In [6]:
conn.execute(text("""
    INSERT INTO accounts (user_id, name, amount) VALUES (1, "A", 10)
"""))

In [7]:
conn.execute(text("""
    INSERT INTO accounts (user_id, name, amount) VALUES (1, "B", 100)
"""))

In [8]:
conn.commit()

In [9]:
# foreign key prevents this
# conn.execute(text("""
#     DELETE FROM users WHERE id = 1
# """))

# Load CSVs to MySQL Tables

In [10]:
import pandas as pd
url = "https://raw.githubusercontent.com/cfpb/api/master/resources/datasets/hmda/code_sheets/"
df = pd.read_csv(url + "action_taken.csv")
df.to_sql("actions", conn, index=False, if_exists="replace")
df = pd.read_csv(url + "loan_type.csv")
df.to_sql("loan_types", conn, index=False, if_exists="replace")
df = pd.read_csv(url + "loan_purpose.csv")
df.to_sql("purposes", conn, index=False, if_exists="replace")
conn.commit()

In [11]:
import pyarrow as pa
import pyarrow.csv, pyarrow.parquet
pa.parquet.write_table(pa.csv.read_csv("hdma-wi-2021.csv"), "loans.parquet")
t = pa.parquet.read_table("loans.parquet", columns=["lei", "action_taken", "loan_type", "loan_amount", "interest_rate", "loan_purpose", "income"])

In [12]:
t.to_pandas().to_sql("loans", conn, index=False, if_exists="replace", chunksize=10000)
conn.commit()

In [13]:
conn.execute(text("""
UPDATE accounts SET amount = amount - 4 WHERE name = 'A'
"""))

conn.execute(text("""
UPDATE accounts SET amount = amount + 4 WHERE name = 'B'
"""))

remaining = list(conn.execute(text("SELECT amount FROM accounts WHERE name = 'A'")))[0][0]
if remaining >= 0:
    print("it worked!")
    conn.commit()
else:
    print("not enough funds")
    conn.rollback()

pd.read_sql("SELECT * FROM accounts", conn)

it worked!

   user_id name  amount
0        1    A       6
1        1    B     104

# Queries

In [14]:
# what are the first 10 loans?  Practice LIMIT.
pd.read_sql("SELECT * FROM loans LIMIT 10", conn)

,lei,action_taken,loan_type,loan_amount,interest_rate,loan_purpose,income
0,54930034MNPILHP25H80,6,1,305000.0,3.875,1,108.0
1,54930034MNPILHP25H80,4,1,65000.0,NA,1,103.0
2,54930034MNPILHP25H80,6,1,75000.0,3.25,1,146.0
3,54930034MNPILHP25H80,1,1,155000.0,4.0,32,70.0
4,54930034MNPILHP25H80,1,1,305000.0,3.25,1,71.0
5,54930034MNPILHP25H80,1,1,175000.0,3.375,1,117.0
6,54930034MNPILHP25H80,1,1,575000.0,4.5,1,180.0
7,54930034MNPILHP25H80,1,1,105000.0,5.375,1,180.0
8,54930034MNPILHP25H80,1,1,85000.0,3.375,1,136.0
9,549300FQ2SN6TRRGB032,1,1,405000.0,Exempt,1,NaN

In [15]:
# projection: choosing what columns (SELECT)

In [16]:
# selection: filtering rows (WHERE)

In [17]:
# what are the first 10 interest rates and loan amounts (in thousands)?  Practice SELECT.
pd.read_sql("""
SELECT interest_rate, loan_amount / 1000 AS amount
FROM loans
LIMIT 10
""", conn)

  interest_rate  amount
0         3.875   305.0
1            NA    65.0
2          3.25    75.0
3           4.0   155.0
4          3.25   305.0
5         3.375   175.0
6           4.5   575.0
7         5.375   105.0
8         3.375    85.0
9        Exempt   405.0

In [18]:
# what are the loans for individuals with income over $1 million?  Practice WHERE.
# what are the first 10 interest rates and loan amounts (in thousands)?  Practice SELECT.
pd.read_sql("""
SELECT *
FROM loans
WHERE income > 1000
""", conn)

,lei,action_taken,loan_type,loan_amount,interest_rate,loan_purpose,income
0,549300SELI3XCH3UZW80,4,1,3005000.0,NA,1,1144.0
1,549300SELI3XCH3UZW80,1,1,285000.0,3.0,1,1382.0
2,549300SELI3XCH3UZW80,1,1,525000.0,2.375,31,1263.0
3,2WHM8VNJH63UN14OL754,1,1,255000.0,2.5,31,1067.0
4,2WHM8VNJH63UN14OL754,4,1,525000.0,NA,1,1439.0
...,...,...,...,...,...,...,...
924,549300LZLYU85WF65870,1,1,505000.0,2.875,32,1114.0
925,549300LZLYU85WF65870,1,1,325000.0,3.125,31,1011.0
926,549300LZLYU85WF65870,1,1,125000.0,2.99,4,1013.0
927,549300LZLYU85WF65870,1,1,345000.0,3.875,32,1376.0
928,549300OSYCBC27271359,1,1,465000.0,3.0,32,1293.0

In [19]:
# what are the five biggest loans in terms of dollar amount?  Practice ORDER BY.
df = pd.read_sql("""
SELECT *
FROM loans
ORDER BY loan_amount DESC
LIMIT 5
""", conn)
df

,lei,action_taken,loan_type,loan_amount,interest_rate,loan_purpose,income
0,549300XWUSRVVOHPRY47,6,1,264185000.0,NA,1,None
1,AD6GFRVSDT01YPT1CS68,1,1,74755000.0,1.454,1,None
2,AD6GFRVSDT01YPT1CS68,4,2,66005000.0,NA,1,None
3,YQI2CPR3Z44KAR0HG822,1,1,65005000.0,3.0,1,None
4,254900YA1AQXNM8QVZ06,1,2,63735000.0,2.99,2,None

In [20]:
pd.read_sql("""
SELECT *
FROM actions LIMIT 3
""", conn)

   id                                 action_taken
0   1                              Loan originated
1   2        Application approved but not accepted
2   3  Application denied by financial institution

In [21]:
pd.read_sql("""
SELECT *
FROM loan_types LIMIT 3
""", conn)

   id      loan_type
0   1   Conventional
1   2    FHA-insured
2   3  VA-guaranteed

In [22]:
# what are the actions taken and types for those loans (show the text, not numbers)?  Practice INNER JOIN.

In [23]:
pd.read_sql("""
SELECT loan_amount, actions.action_taken, loan_types.loan_type
FROM loans
INNER JOIN actions ON loans.action_taken = actions.id
INNER JOIN loan_types ON loans.loan_type = loan_types.id
LIMIT 3
""", conn)

   loan_amount                        action_taken     loan_type
0     305000.0   Loan purchased by the institution  Conventional
1      65000.0  Application withdrawn by applicant  Conventional
2      75000.0   Loan purchased by the institution  Conventional

In [24]:
# what is a loan_purpose that doesn't appear in the loans table?  Practice LEFT/RIGHT JOIN.

In [25]:
pd.read_sql("SELECT * FROM loans LIMIT 3", conn)

,lei,action_taken,loan_type,loan_amount,interest_rate,loan_purpose,income
0,54930034MNPILHP25H80,6,1,305000.0,3.875,1,108.0
1,54930034MNPILHP25H80,4,1,65000.0,NA,1,103.0
2,54930034MNPILHP25H80,6,1,75000.0,3.25,1,146.0

In [30]:
pd.read_sql("""
SELECT purposes.*
FROM purposes
LEFT JOIN loans ON purposes.id = loans.loan_purpose
WHERE loans.loan_purpose IS NULL
""", conn)

   id loan_purpose
0   3  Refinancing

In [27]:
# how many rows are in the table?  Practice COUNT(*).

In [31]:
pd.read_sql("""
SELECT COUNT(*) FROM loans;
""", conn)

   COUNT(*)
0    447367

In [28]:
# how many non-null values are in the income column?  Practice COUNT(column).

In [32]:
pd.read_sql("""
SELECT COUNT(income) FROM loans;
""", conn)

   COUNT(income)
0         399948

In [38]:
# what is the average interest rate for loans of type "Conventional"?  Practice AVG.
pd.read_sql("""
SELECT AVG(interest_rate)
FROM loans
INNER JOIN loan_types ON loans.loan_type = loan_types.id
WHERE loan_types.loan_type = "Conventional"
""", conn)

   AVG(interest_rate)
0             2.21657

In [41]:
# how many loans are there of each type?  Practice GROUP BY.
pd.read_sql("""
SELECT loan_types.loan_type, AVG(interest_rate), COUNT(*) AS c
FROM loans
INNER JOIN loan_types ON loans.loan_type = loan_types.id
GROUP BY loan_types.loan_type
""", conn)

            loan_type  AVG(interest_rate)       c
0        Conventional            2.216570  389217
1       VA-guaranteed            1.919140   24551
2         FHA-insured            2.211670   30496
3  FSA/RHS-guaranteed            2.523942    3103

In [ ]:
# which loan types appear at least 10,000 times?  Practice HAVING.

In [43]:
pd.read_sql("""
SELECT loan_types.loan_type, AVG(interest_rate), COUNT(*) AS c
FROM loans
INNER JOIN loan_types ON loans.loan_type = loan_types.id
GROUP BY loan_types.loan_type
HAVING c >= 10000
""", conn)

       loan_type  AVG(interest_rate)       c
0   Conventional             2.21657  389217
1  VA-guaranteed             1.91914   24551
2    FHA-insured             2.21167   30496